#!/usr/bin/python3
a = 2000    #переменной a присваивается объект 2000
c = a   #создается переменная c, которая ссылается на тот же объект что и переменная a
print(id(a), id(c))    #125993602883920 125993602883920
c += 1000   #операция += создает новый объект, переменная с больше не связанна с переменной а
print(id(a), id(c))    #125993602092016
b = 3000    #создается новая переменная b которая ссылается на объект 3000
print(id(b))    #125993602091952
print(c == b, c is b)   #True False
#значение с равняется значению b, однако они ссылаются на разные объекты, т.е. их id не равны, поэтомы оператор is возвращает False

